InformationRegisters/Нумерация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Нумерация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Нумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нумераторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНумерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПериодичностьНумераторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПериодичностьНумераторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Непериодический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Нумераторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Нумераторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьНумераторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияНумерации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Нумерация/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ЗаписьНаСегодня(Нумератор, Организация) Экспорт

	Периодичность = Перечисления.ПериодичностьНумераторов.Непериодический;
	Если Нумератор <> Неопределено
		И Нумератор <> Справочники.Нумераторы.ПустаяСсылка() Тогда
	
		Периодичность = Нумератор.Периодичность;
	
	КонецЕсли;
	ПериодНумерации = НачалоПериодаНумерации(
		Периодичность,
		ТекущаяДатаСеанса()
	);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Нумератор = Нумератор;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.ПериодНумерации = ПериодНумерации;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Нумератор = Нумератор;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.ПериодНумерации = ПериодНумерации;
	
	Возврат МенеджерЗаписи;

КонецФункции // ()

Функция НовыйНомер(Нумератор, Организация) Экспорт

	МенеджерЗаписи = ЗаписьНаСегодня(Нумератор, Организация);
	
	МенеджерЗаписи.ТекущийНомер = МенеджерЗаписи.ТекущийНомер + 1;
	МенеджерЗаписи.Записать(Истина);
	
	Возврат МенеджерЗаписи.ТекущийНомер;

КонецФункции // ()

Функция Составитель(Нумератор) Экспорт

	Если Не ЗначениеЗаполнено(Нумератор) Тогда
	
		ВызватьИсключение УправленияСообщениямиКлиентСервер.НеКорректныйПараметр(
			"Передан пустой нумератор"
		);
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Нумератор.ФункцияНумерации) Тогда
	
		ВызватьИсключение УправленияСообщениямиКлиентСервер.НеКорректныйПараметр(
			"У нумератора не задана функция нумерации"
		);
	
	КонецЕсли;
	
	Возврат Нумератор.ФункцияНумерации.Функция;

КонецФункции // ()


Функция СформироватьНомерЕСИА(Элемент, Организация) Экспорт

	Возврат СформироватьНомер(Элемент, Организация, Организация);

КонецФункции // ()

Функция СформироватьНомер(Элемент, Организация, Объект) Экспорт

	НовыйНомер = НовыйНомер(Элемент, Организация);
	СоставительНомера = Составитель(Элемент);
	
	Возврат Справочники.ШаблоныТекстаДляАвтоинформирования.ВычислитьФункцию(
		СоставительНомера,
		Объект,
		НовыйНомер
	);

КонецФункции // ()



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НачалоПериодаНумерации(Периодичность, ДатаНомера) Экспорт
	
	Если Периодичность = Перечисления.ПериодичностьНумераторов.День Тогда
		ПериодНумерации = НачалоДня(ДатаНомера);
		
	ИначеЕсли Периодичность = Перечисления.ПериодичностьНумераторов.Месяц Тогда
		ПериодНумерации = НачалоМесяца(ДатаНомера);
		
	ИначеЕсли Периодичность = Перечисления.ПериодичностьНумераторов.Квартал Тогда
		ПериодНумерации = НачалоКвартала(ДатаНомера);
		
	ИначеЕсли Периодичность = Перечисления.ПериодичностьНумераторов.Год Тогда
		ПериодНумерации = НачалоГода(ДатаНомера);
		
	ИначеЕсли Периодичность = Перечисления.ПериодичностьНумераторов.Непериодический Тогда 
		ПериодНумерации = Дата(1, 1, 1);
		
	Иначе
		ПериодНумерации = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат ПериодНумерации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
